[Killed] BlockStatement
src/services/translateService.ts:13:55
 }
 
 /** Trims and validates the input, returning the normalised phrase. */
-export function normalisePhrase(word: string): string {
-  if (!word || typeof word !== 'string') {
-    throw new Error('Некорректный текст для перевода');
-  }
-
-  const cleaned = word.trim().toLowerCase();
-  const wordCount = cleaned.split(/\s+/).filter(Boolean).length;
-
-  if (wordCount === 0 || wordCount > MAX_PHRASE_WORDS) {
-    throw new Error(`Можно переводить от 1 до ${MAX_PHRASE_WORDS} слов`);
-  }
-
-  return cleaned;
-}
+export function normalisePhrase(word: string): string {}
 
 /** Single words may already be in the user's dictionary; phrases never are. */
killedBy: normalisePhrase trims and lowercases
statusReason: expected undefined to be 'książka' // Object.is equality

[Killed] ConditionalExpression
src/services/translateService.ts:14:16
 
 /** Trims and validates the input, returning the normalised phrase. */
 export function normalisePhrase(word: string): string {
-  if (!word || typeof word !== 'string') {
+  if (!word || false) {
     throw new Error('Некорректный текст для перевода');
   }
killedBy: normalisePhrase rejects a non-string
statusReason: expected [Function] to throw error matching /Некорректный текст/ but got 'word.trim is not a function'

[Killed] ConditionalExpression
src/services/translateService.ts:14:7
 
 /** Trims and validates the input, returning the normalised phrase. */
 export function normalisePhrase(word: string): string {
-  if (!word || typeof word !== 'string') {
+  if (true) {
     throw new Error('Некорректный текст для перевода');
   }
killedBy: normalisePhrase trims and lowercases
statusReason: Некорректный текст для перевода

[Killed] MethodExpression
src/services/translateService.ts:18:19
     throw new Error('Некорректный текст для перевода');
   }
 
-  const cleaned = word.trim().toLowerCase();
+  const cleaned = word.trim().toUpperCase();
   const wordCount = cleaned.split(/\s+/).filter(Boolean).length;
 
killedBy: normalisePhrase trims and lowercases
statusReason: expected 'KSIĄŻKA' to be 'książka' // Object.is equality

[Killed] MethodExpression
src/services/translateService.ts:18:19
     throw new Error('Некорректный текст для перевода');
   }
 
-  const cleaned = word.trim().toLowerCase();
+  const cleaned = word.toLowerCase();
   const wordCount = cleaned.split(/\s+/).filter(Boolean).length;
 
killedBy: normalisePhrase trims and lowercases
statusReason: expected '  książka  ' to be 'książka' // Object.is equality

[Killed] MethodExpression
src/services/translateService.ts:19:21
   }
 
   const cleaned = word.trim().toLowerCase();
-  const wordCount = cleaned.split(/\s+/).filter(Boolean).length;
+  const wordCount = cleaned.split(/\s+/).length;
 
   if (wordCount === 0 || wordCount > MAX_PHRASE_WORDS) {
killedBy: normalisePhrase rejects whitespace only
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/services/translateService.ts:21:26
   const cleaned = word.trim().toLowerCase();
   const wordCount = cleaned.split(/\s+/).filter(Boolean).length;
 
-  if (wordCount === 0 || wordCount > MAX_PHRASE_WORDS) {
+  if (wordCount === 0 || false) {
     throw new Error(`Можно переводить от 1 до ${MAX_PHRASE_WORDS} слов`);
   }
killedBy: normalisePhrase rejects a phrase of six words
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/services/translateService.ts:21:7
   const cleaned = word.trim().toLowerCase();
   const wordCount = cleaned.split(/\s+/).filter(Boolean).length;
 
-  if (wordCount === 0 || wordCount > MAX_PHRASE_WORDS) {
+  if (true) {
     throw new Error(`Можно переводить от 1 до ${MAX_PHRASE_WORDS} слов`);
   }
killedBy: normalisePhrase trims and lowercases
statusReason: Можно переводить от 1 до 5 слов

[Killed] StringLiteral
src/services/translateService.ts:22:21
   const wordCount = cleaned.split(/\s+/).filter(Boolean).length;
 
   if (wordCount === 0 || wordCount > MAX_PHRASE_WORDS) {
-    throw new Error(`Можно переводить от 1 до ${MAX_PHRASE_WORDS} слов`);
+    throw new Error(``);
   }
 
killedBy: normalisePhrase rejects a phrase of six words
statusReason: expected [Function] to throw error matching /от 1 до 5/ but got ''

[Killed] BlockStatement
src/services/translateService.ts:29:100
 }
 
 /** Single words may already be in the user's dictionary; phrases never are. */
-async function findInDictionary(userId: string, phrase: string): Promise<TranslationResult | null> {
-  if (phrase.includes(' ')) return null;
-
-  const existing = await wordRepository.findByWord(userId, phrase);
-  if (!existing) return null;
-
-  return { text: existing.translate, exists: true, wordId: existing.id };
-}
+async function findInDictionary(userId: string, phrase: string): Promise<TranslationResult | null> {}
 
 async function callDeepl(token: string, phrase: string, source: string, target: string) {
killedBy: translateWordService returns the dictionary entry for a known single word
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] ConditionalExpression
src/services/translateService.ts:30:7
 
 /** Single words may already be in the user's dictionary; phrases never are. */
 async function findInDictionary(userId: string, phrase: string): Promise<TranslationResult | null> {
-  if (phrase.includes(' ')) return null;
+  if (false) return null;
 
   const existing = await wordRepository.findByWord(userId, phrase);
killedBy: translateWordService never looks a multi-word phrase up in the dictionary
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "u1",

[Killed] ConditionalExpression
src/services/translateService.ts:30:7
 
 /** Single words may already be in the user's dictionary; phrases never are. */
 async function findInDictionary(userId: string, phrase: string): Promise<TranslationResult | null> {
-  if (phrase.includes(' ')) return null;
+  if (true) return null;
 
   const existing = await wordRepository.findByWord(userId, phrase);
killedBy: translateWordService returns the dictionary entry for a known single word
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] ConditionalExpression
src/services/translateService.ts:33:7
   if (phrase.includes(' ')) return null;
 
   const existing = await wordRepository.findByWord(userId, phrase);
-  if (!existing) return null;
+  if (true) return null;
 
   return { text: existing.translate, exists: true, wordId: existing.id };
killedBy: translateWordService returns the dictionary entry for a known single word
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] BooleanLiteral
src/services/translateService.ts:33:7
   if (phrase.includes(' ')) return null;
 
   const existing = await wordRepository.findByWord(userId, phrase);
-  if (!existing) return null;
+  if (existing) return null;
 
   return { text: existing.translate, exists: true, wordId: existing.id };
killedBy: translateWordService returns the dictionary entry for a known single word
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] BooleanLiteral
src/services/translateService.ts:35:46
   const existing = await wordRepository.findByWord(userId, phrase);
   if (!existing) return null;
 
-  return { text: existing.translate, exists: true, wordId: existing.id };
+  return { text: existing.translate, exists: false, wordId: existing.id };
 }
 
killedBy: translateWordService returns the dictionary entry for a known single word
statusReason: expected { text: 'книга', exists: false, …(1) } to deeply equal { text: 'книга', exists: true, …(1) }

[Survived] ObjectLiteral
src/services/translateService.ts:41:14
 async function callDeepl(token: string, phrase: string, source: string, target: string) {
   const response = await fetch(DEEPL_ENDPOINT, {
     method: 'POST',
-    headers: {
-      'Content-Type': 'application/x-www-form-urlencoded',
-      Authorization: `DeepL-Auth-Key ${token}`
-    },
+    headers: {},
     body: new URLSearchParams({
       text: phrase,

[Survived] StringLiteral
src/services/translateService.ts:43:22
     method: 'POST',
     headers: {
       'Content-Type': 'application/x-www-form-urlencoded',
-      Authorization: `DeepL-Auth-Key ${token}`
+      Authorization: ``
     },
     body: new URLSearchParams({

[Killed] BlockStatement
src/services/translateService.ts:52:21
     }).toString()
   });
 
-  if (!response.ok) {
-    const errorData = await response.json().catch(() => ({}));
-    throw new Error(
-      `DeepL API error: ${response.status} - ${errorData.message || response.statusText}`
-    );
-  }
+  if (!response.ok) {}
 
   const data = await response.json();
killedBy: translateWordService surfaces a DeepL HTTP error
statusReason: expected [Function] to throw error matching /429 - quota exceeded/ but got 'quota exceeded'

[Killed] LogicalOperator
src/services/translateService.ts:55:48
   if (!response.ok) {
     const errorData = await response.json().catch(() => ({}));
     throw new Error(
-      `DeepL API error: ${response.status} - ${errorData.message || response.statusText}`
+      `DeepL API error: ${response.status} - ${errorData.message && response.statusText}`
     );
   }
killedBy: translateWordService surfaces a DeepL HTTP error
statusReason: expected [Function] to throw error matching /429 - quota exceeded/ but got 'DeepL API error: 429 - Too Many Reque…'

[Killed] ConditionalExpression
src/services/translateService.ts:55:48
   if (!response.ok) {
     const errorData = await response.json().catch(() => ({}));
     throw new Error(
-      `DeepL API error: ${response.status} - ${errorData.message || response.statusText}`
+      `DeepL API error: ${response.status} - ${false}`
     );
   }
killedBy: translateWordService surfaces a DeepL HTTP error
statusReason: expected [Function] to throw error matching /429 - quota exceeded/ but got 'DeepL API error: 429 - false'

[Killed] OptionalChaining
src/services/translateService.ts:60:22
   }
 
   const data = await response.json();
-  const translated = data.translations?.[0]?.text;
+  const translated = data.translations?.[0].text;
   if (!translated) {
     throw new Error(data.message || 'Ошибка перевода');
killedBy: translateWordService fails when DeepL returns no translation
statusReason: expected [Function] to throw error matching /Ошибка перевода/ but got 'Cannot read properties of undefined (…'

[Survived] OptionalChaining
src/services/translateService.ts:60:22
   }
 
   const data = await response.json();
-  const translated = data.translations?.[0]?.text;
+  const translated = data.translations[0]?.text;
   if (!translated) {
     throw new Error(data.message || 'Ошибка перевода');

[Killed] BlockStatement
src/services/translateService.ts:61:20
 
   const data = await response.json();
   const translated = data.translations?.[0]?.text;
-  if (!translated) {
-    throw new Error(data.message || 'Ошибка перевода');
-  }
+  if (!translated) {}
 
   return translated as string;
killedBy: translateWordService fails when DeepL returns no translation
statusReason: promise resolved "{ text: undefined, exists: false }" instead of rejecting

[Killed] ConditionalExpression
src/services/translateService.ts:61:7
 
   const data = await response.json();
   const translated = data.translations?.[0]?.text;
-  if (!translated) {
+  if (true) {
     throw new Error(data.message || 'Ошибка перевода');
   }
killedBy: translateWordService never looks a multi-word phrase up in the dictionary
statusReason: promise rejected "Error: Ошибка перевода" instead of resolving

[Killed] ConditionalExpression
src/services/translateService.ts:62:21
   const data = await response.json();
   const translated = data.translations?.[0]?.text;
   if (!translated) {
-    throw new Error(data.message || 'Ошибка перевода');
+    throw new Error(true);
   }
 
killedBy: translateWordService fails when DeepL returns no translation
statusReason: expected [Function] to throw error matching /Ошибка перевода/ but got 'true'

[Killed] ConditionalExpression
src/services/translateService.ts:62:21
   const data = await response.json();
   const translated = data.translations?.[0]?.text;
   if (!translated) {
-    throw new Error(data.message || 'Ошибка перевода');
+    throw new Error(false);
   }
 
killedBy: translateWordService fails when DeepL returns no translation
statusReason: expected [Function] to throw error matching /Ошибка перевода/ but got 'false'

[Killed] BlockStatement
src/services/translateService.ts:71:31
 export async function translateWordService(
   userId: string,
   word: string
-): Promise<TranslationResult> {
-  const phrase = normalisePhrase(word);
-
-  const known = await findInDictionary(userId, phrase);
-  if (known) return known;
-
-  const userSettings = await userSettingsRepository.findByUserId(userId);
-  const sourceLang = (userSettings?.learningLanguage || 'EN').toUpperCase();
-  const targetLang = (userSettings?.translationLang || 'RU').toUpperCase();
-
-  const tokens = await userTokenRepository.findByUser(userId);
-  const deeplToken = tokens.find(t => t.service === 'deepl')?.token;
-  if (!deeplToken) {
-    throw new Error('Токен DeepL не найден');
-  }
-
-  return { text: await callDeepl(deeplToken, phrase, sourceLang, targetLang), exists: false };
-}
+): Promise<TranslationResult> {}
 
killedBy: translateWordService returns the dictionary entry for a known single word
statusReason: expected undefined to deeply equal { text: 'книга', exists: true, …(1) }

[Killed] ConditionalExpression
src/services/translateService.ts:75:7
   const phrase = normalisePhrase(word);
 
   const known = await findInDictionary(userId, phrase);
-  if (known) return known;
+  if (true) return known;
 
   const userSettings = await userSettingsRepository.findByUserId(userId);
killedBy: translateWordService never looks a multi-word phrase up in the dictionary
statusReason: expected null to deeply equal { text: 'добрый день', exists: false }

[Killed] ConditionalExpression
src/services/translateService.ts:75:7
   const phrase = normalisePhrase(word);
 
   const known = await findInDictionary(userId, phrase);
-  if (known) return known;
+  if (false) return known;
 
   const userSettings = await userSettingsRepository.findByUserId(userId);
killedBy: translateWordService returns the dictionary entry for a known single word
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] OptionalChaining
src/services/translateService.ts:78:23
   if (known) return known;
 
   const userSettings = await userSettingsRepository.findByUserId(userId);
-  const sourceLang = (userSettings?.learningLanguage || 'EN').toUpperCase();
+  const sourceLang = (userSettings.learningLanguage || 'EN').toUpperCase();
   const targetLang = (userSettings?.translationLang || 'RU').toUpperCase();
 
killedBy: translateWordService falls back to EN/RU when settings are missing
statusReason: Cannot read properties of null (reading 'learningLanguage')

[Killed] MethodExpression
src/services/translateService.ts:78:22
   if (known) return known;
 
   const userSettings = await userSettingsRepository.findByUserId(userId);
-  const sourceLang = (userSettings?.learningLanguage || 'EN').toUpperCase();
+  const sourceLang = (userSettings?.learningLanguage || 'EN').toLowerCase();
   const targetLang = (userSettings?.translationLang || 'RU').toUpperCase();
 
killedBy: translateWordService calls DeepL with the languages from user settings
statusReason: expected 'text=ksi%C4%85%C5%BCka&target_lang=RU…' to contain 'source_lang=PL'

[Killed] MethodExpression
src/services/translateService.ts:79:22
 
   const userSettings = await userSettingsRepository.findByUserId(userId);
   const sourceLang = (userSettings?.learningLanguage || 'EN').toUpperCase();
-  const targetLang = (userSettings?.translationLang || 'RU').toUpperCase();
+  const targetLang = (userSettings?.translationLang || 'RU').toLowerCase();
 
   const tokens = await userTokenRepository.findByUser(userId);
killedBy: translateWordService calls DeepL with the languages from user settings
statusReason: expected 'text=ksi%C4%85%C5%BCka&target_lang=ru…' to contain 'target_lang=RU'

[Killed] LogicalOperator
src/services/translateService.ts:79:23
 
   const userSettings = await userSettingsRepository.findByUserId(userId);
   const sourceLang = (userSettings?.learningLanguage || 'EN').toUpperCase();
-  const targetLang = (userSettings?.translationLang || 'RU').toUpperCase();
+  const targetLang = (userSettings?.translationLang && 'RU').toUpperCase();
 
   const tokens = await userTokenRepository.findByUser(userId);
killedBy: translateWordService falls back to EN/RU when settings are missing
statusReason: Cannot read properties of undefined (reading 'toUpperCase')

[Killed] ConditionalExpression
src/services/translateService.ts:82:39
   const targetLang = (userSettings?.translationLang || 'RU').toUpperCase();
 
   const tokens = await userTokenRepository.findByUser(userId);
-  const deeplToken = tokens.find(t => t.service === 'deepl')?.token;
+  const deeplToken = tokens.find(t => true)?.token;
   if (!deeplToken) {
     throw new Error('Токен DeepL не найден');
killedBy: translateWordService fails when the user has no DeepL token
statusReason: promise resolved "{ text: 'книга', exists: false }" instead of rejecting

[Killed] ConditionalExpression
src/services/translateService.ts:82:39
   const targetLang = (userSettings?.translationLang || 'RU').toUpperCase();
 
   const tokens = await userTokenRepository.findByUser(userId);
-  const deeplToken = tokens.find(t => t.service === 'deepl')?.token;
+  const deeplToken = tokens.find(t => false)?.token;
   if (!deeplToken) {
     throw new Error('Токен DeepL не найден');
killedBy: translateWordService never looks a multi-word phrase up in the dictionary
statusReason: promise rejected "Error: Токен DeepL не найден" instead of resolving

[Killed] ConditionalExpression
src/services/translateService.ts:83:7
 
   const tokens = await userTokenRepository.findByUser(userId);
   const deeplToken = tokens.find(t => t.service === 'deepl')?.token;
-  if (!deeplToken) {
+  if (false) {
     throw new Error('Токен DeepL не найден');
   }
killedBy: translateWordService fails when the user has no DeepL token
statusReason: promise resolved "{ text: 'книга', exists: false }" instead of rejecting

[Killed] BooleanLiteral
src/services/translateService.ts:83:7
 
   const tokens = await userTokenRepository.findByUser(userId);
   const deeplToken = tokens.find(t => t.service === 'deepl')?.token;
-  if (!deeplToken) {
+  if (deeplToken) {
     throw new Error('Токен DeepL не найден');
   }
killedBy: translateWordService never looks a multi-word phrase up in the dictionary
statusReason: promise rejected "Error: Токен DeepL не найден" instead of resolving

[Killed] StringLiteral
src/services/translateService.ts:84:21
   const tokens = await userTokenRepository.findByUser(userId);
   const deeplToken = tokens.find(t => t.service === 'deepl')?.token;
   if (!deeplToken) {
-    throw new Error('Токен DeepL не найден');
+    throw new Error("");
   }
 
killedBy: translateWordService fails when the user has no DeepL token
statusReason: expected [Function] to throw error matching /Токен DeepL/ but got ''

[Killed] BooleanLiteral
src/services/translateService.ts:87:87
     throw new Error('Токен DeepL не найден');
   }
 
-  return { text: await callDeepl(deeplToken, phrase, sourceLang, targetLang), exists: false };
+  return { text: await callDeepl(deeplToken, phrase, sourceLang, targetLang), exists: true };
 }
 
killedBy: translateWordService never looks a multi-word phrase up in the dictionary
statusReason: expected { text: 'добрый день', exists: true } to deeply equal { text: 'добрый день', exists: false }
