[Killed] Regex
src/utils/exerciseContent.ts:21:24
 
 const PLACEHOLDER_REGEX = /\{\{input\}\}/gi;
 const BOLD_PATTERN = /\*\*([^*]+)\*\*/g;
-const TRAILING_HINTS = /\s*\(([^)]+)\)\s*$/;
+const TRAILING_HINTS = /\s*\(([)]+)\)\s*$/;
 const TRANSLATION_LABEL = /^(?:перевод|translation)\s*[:−-]?\s*/i;
 // `\b` is ASCII-only in JS, so it never fires after a Cyrillic word - a
killedBy: takeHints splits trailing hints off the sentence
statusReason: expected { …(2) } to deeply equal { Object (line, hints) }

[Killed] Regex
src/utils/exerciseContent.ts:21:24
 
 const PLACEHOLDER_REGEX = /\{\{input\}\}/gi;
 const BOLD_PATTERN = /\*\*([^*]+)\*\*/g;
-const TRAILING_HINTS = /\s*\(([^)]+)\)\s*$/;
+const TRAILING_HINTS = /\s\(([^)]+)\)\s*$/;
 const TRANSLATION_LABEL = /^(?:перевод|translation)\s*[:−-]?\s*/i;
 // `\b` is ASCII-only in JS, so it never fires after a Cyrillic word - a
killedBy: takeHints accepts hints glued to the sentence with no space
statusReason: expected { line: 'Zdanie.(a)', hints: [] } to deeply equal { line: 'Zdanie.', hints: [ 'a' ] }

[Killed] Regex
src/utils/exerciseContent.ts:22:27
 const PLACEHOLDER_REGEX = /\{\{input\}\}/gi;
 const BOLD_PATTERN = /\*\*([^*]+)\*\*/g;
 const TRAILING_HINTS = /\s*\(([^)]+)\)\s*$/;
-const TRANSLATION_LABEL = /^(?:перевод|translation)\s*[:−-]?\s*/i;
+const TRANSLATION_LABEL = /^(?:перевод|translation)\s*[:−-]\s*/i;
 // `\b` is ASCII-only in JS, so it never fires after a Cyrillic word - a
 // Unicode-aware "not followed by a letter or digit" lookahead is required for
killedBy: stripTranslationLabel accepts a label with no separator at all
statusReason: expected 'Перевод я читаю' to be 'я читаю' // Object.is equality

[Killed] Regex
src/utils/exerciseContent.ts:22:27
 const PLACEHOLDER_REGEX = /\{\{input\}\}/gi;
 const BOLD_PATTERN = /\*\*([^*]+)\*\*/g;
 const TRAILING_HINTS = /\s*\(([^)]+)\)\s*$/;
-const TRANSLATION_LABEL = /^(?:перевод|translation)\s*[:−-]?\s*/i;
+const TRANSLATION_LABEL = /^(?:перевод|translation)\s*[^:−-]?\s*/i;
 // `\b` is ASCII-only in JS, so it never fires after a Cyrillic word - a
 // Unicode-aware "not followed by a letter or digit" lookahead is required for
killedBy: stripTranslationLabel drops a Russian label with a colon
statusReason: expected ': я читаю' to be 'я читаю' // Object.is equality

[Killed] Regex
src/utils/exerciseContent.ts:26:26
 // `\b` is ASCII-only in JS, so it never fires after a Cyrillic word - a
 // Unicode-aware "not followed by a letter or digit" lookahead is required for
 // "Перевод:" to be recognised at all.
-const TRANSLATION_LINE = /^(?:перевод|translation)(?![\p{L}\p{N}])/iu;
+const TRANSLATION_LINE = /^(?:перевод|translation)(?=[\p{L}\p{N}])/iu;
 const LEADING_NUMBERING = /^(?:[\d]+[).\s]+|[-*]\s+)/;
 // `(\S.*)` rather than `(.+)`: a dangling dash with nothing but spaces after it
killedBy: takeTranslationLine prefers a labelled line and removes it
statusReason: expected 'Uwaga: czas przeszły' to be 'Она читает' // Object.is equality

[Killed] Regex
src/utils/exerciseContent.ts:26:26
 // `\b` is ASCII-only in JS, so it never fires after a Cyrillic word - a
 // Unicode-aware "not followed by a letter or digit" lookahead is required for
 // "Перевод:" to be recognised at all.
-const TRANSLATION_LINE = /^(?:перевод|translation)(?![\p{L}\p{N}])/iu;
+const TRANSLATION_LINE = /^(?:перевод|translation)(?![^\p{L}\p{N}])/iu;
 const LEADING_NUMBERING = /^(?:[\d]+[).\s]+|[-*]\s+)/;
 // `(\S.*)` rather than `(.+)`: a dangling dash with nothing but spaces after it
killedBy: takeTranslationLine prefers a labelled line and removes it
statusReason: expected 'Uwaga: czas przeszły' to be 'Она читает' // Object.is equality

[Killed] Regex
src/utils/exerciseContent.ts:27:27
 // Unicode-aware "not followed by a letter or digit" lookahead is required for
 // "Перевод:" to be recognised at all.
 const TRANSLATION_LINE = /^(?:перевод|translation)(?![\p{L}\p{N}])/iu;
-const LEADING_NUMBERING = /^(?:[\d]+[).\s]+|[-*]\s+)/;
+const LEADING_NUMBERING = /^(?:[\d]+[).\s]+|[-*]\S+)/;
 // `(\S.*)` rather than `(.+)`: a dangling dash with nothing but spaces after it
 // is not a translation, and must leave the sentence untouched.
killedBy: parseExerciseContent strips a leading bullet
statusReason: expected '- Ona _____ książkę.' to be 'Ona _____ książkę.' // Object.is equality

[Killed] Regex
src/utils/exerciseContent.ts:27:27
 // Unicode-aware "not followed by a letter or digit" lookahead is required for
 // "Перевод:" to be recognised at all.
 const TRANSLATION_LINE = /^(?:перевод|translation)(?![\p{L}\p{N}])/iu;
-const LEADING_NUMBERING = /^(?:[\d]+[).\s]+|[-*]\s+)/;
+const LEADING_NUMBERING = /^(?:[\d]+[).\s]+|[^-*]\s+)/;
 // `(\S.*)` rather than `(.+)`: a dangling dash with nothing but spaces after it
 // is not a translation, and must leave the sentence untouched.
killedBy: parseExerciseContent strips a leading bullet
statusReason: expected '- Ona _____ książkę.' to be 'Ona _____ książkę.' // Object.is equality

[Killed] Regex
src/utils/exerciseContent.ts:30:33
 const LEADING_NUMBERING = /^(?:[\d]+[).\s]+|[-*]\s+)/;
 // `(\S.*)` rather than `(.+)`: a dangling dash with nothing but spaces after it
 // is not a translation, and must leave the sentence untouched.
-const INLINE_DASH_TRANSLATION = /^(.*[.!?]\s*)[\s]*[-–—][\s]*(\S.*)$/;
+const INLINE_DASH_TRANSLATION = /^(.[.!?]\s*)[\s]*[-–—][\s]*(\S.*)$/;
 const WORD_CHAR = /[\p{L}\p{N}]/u;
 
killedBy: takeInlineTranslation splits a sentence from its dash-separated translation
statusReason: expected { …(2) } to deeply equal { line: 'Ona czyta.', …(1) }

[Killed] Regex
src/utils/exerciseContent.ts:30:33
 const LEADING_NUMBERING = /^(?:[\d]+[).\s]+|[-*]\s+)/;
 // `(\S.*)` rather than `(.+)`: a dangling dash with nothing but spaces after it
 // is not a translation, and must leave the sentence untouched.
-const INLINE_DASH_TRANSLATION = /^(.*[.!?]\s*)[\s]*[-–—][\s]*(\S.*)$/;
+const INLINE_DASH_TRANSLATION = /^(.*[.!?]\s*)[\s]*[^-–—][\s]*(\S.*)$/;
 const WORD_CHAR = /[\p{L}\p{N}]/u;
 
killedBy: takeInlineTranslation splits a sentence from its dash-separated translation
statusReason: expected { line: 'Ona czyta.', …(1) } to deeply equal { line: 'Ona czyta.', …(1) }

[Killed] StringLiteral
src/utils/exerciseContent.ts:35:20
 
 export const EMPTY_PARSED_CONTENT: ParsedExerciseContent = {
   displaySentence: '',
-  prefillSentence: '',
+  prefillSentence: "Stryker was here!",
   hints: [],
   translation: null,
killedBy: parseExerciseContent returns empty content for a blank string
statusReason: expected { displaySentence: '', …(4) } to deeply equal { displaySentence: '', …(4) }

[Killed] ArrowFunction
src/utils/exerciseContent.ts:41:38
   additionalNotes: []
 };
 
-export const stripTranslationLabel = (value: string): string =>
-  value.replace(TRANSLATION_LABEL, '').trim();
+export const stripTranslationLabel = () => undefined;
 
 /**
killedBy: extractWordAtOffset - idempotence and containment is idempotent: re-expanding from inside the word yields the same word
statusReason: Property failed after 10 tests
{ seed: -37452911, path: "9:4:7:12:11:13:11:11:22:1:16:19:28", endOnFailure: true }
Counterexample: [[" 0Y  Y",5]]
Shrunk 12 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/utils/exerciseContent.ts:42:3
 };
 
 export const stripTranslationLabel = (value: string): string =>
-  value.replace(TRANSLATION_LABEL, '').trim();
+  value.replace(TRANSLATION_LABEL, '');
 
 /**
killedBy: stripTranslationLabel trims whitespace after the value
statusReason: expected 'я читаю   ' to be 'я читаю' // Object.is equality

[Killed] StringLiteral
src/utils/exerciseContent.ts:42:36
 };
 
 export const stripTranslationLabel = (value: string): string =>
-  value.replace(TRANSLATION_LABEL, '').trim();
+  value.replace(TRANSLATION_LABEL, "Stryker was here!").trim();
 
 /**
killedBy: stripTranslationLabel drops a Russian label with a colon
statusReason: expected 'Stryker was here!я читаю' to be 'я читаю' // Object.is equality

[Killed] BlockStatement
src/utils/exerciseContent.ts:49:78
  * No bounds checks are needed: `charAt` returns '' outside the string, which
  * never matches WORD_CHAR and therefore stops the scan on its own.
  */
-export const extractWordAtOffset = (text: string, offset: number): string => {
-  let start = offset;
-  let end = offset;
-
-  while (WORD_CHAR.test(text.charAt(start - 1))) {
-    start--;
-  }
-  while (WORD_CHAR.test(text.charAt(end))) {
-    end++;
-  }
-
-  return text.substring(start, end);
-};
+export const extractWordAtOffset = (text: string, offset: number): string => {};
 
 /** Normalises a selected token, or null when it is not a plain word. */
killedBy: extractWordAtOffset - idempotence and containment always returns a substring of the input
statusReason: Property failed after 1 tests
{ seed: -251377644, path: "0:0", endOnFailure: true }
Counterexample: [["",0]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/exerciseContent.ts:53:10
   let start = offset;
   let end = offset;
 
-  while (WORD_CHAR.test(text.charAt(start - 1))) {
+  while (false) {
     start--;
   }
killedBy: extractWordAtOffset expands from inside a word to its full span
statusReason: expected 'ążkę' to be 'książkę' // Object.is equality

[Killed] ArithmeticOperator
src/utils/exerciseContent.ts:53:37
   let start = offset;
   let end = offset;
 
-  while (WORD_CHAR.test(text.charAt(start - 1))) {
+  while (WORD_CHAR.test(text.charAt(start + 1))) {
     start--;
   }
killedBy: extractWordAtOffset expands from inside a word to its full span
statusReason: expected 'm książkę' to be 'książkę' // Object.is equality

[Killed] UpdateOperator
src/utils/exerciseContent.ts:54:5
   let end = offset;
 
   while (WORD_CHAR.test(text.charAt(start - 1))) {
-    start--;
+    start++;
   }
   while (WORD_CHAR.test(text.charAt(end))) {
killedBy: extractWordAtOffset expands from inside a word to its full span
statusReason: expected '' to be 'książkę' // Object.is equality

[Killed] ConditionalExpression
src/utils/exerciseContent.ts:56:10
   while (WORD_CHAR.test(text.charAt(start - 1))) {
     start--;
   }
-  while (WORD_CHAR.test(text.charAt(end))) {
+  while (false) {
     end++;
   }
killedBy: extractWordAtOffset expands from inside a word to its full span
statusReason: expected 'ksi' to be 'książkę' // Object.is equality

[Timeout] MethodExpression
src/utils/exerciseContent.ts:56:25
   while (WORD_CHAR.test(text.charAt(start - 1))) {
     start--;
   }
-  while (WORD_CHAR.test(text.charAt(end))) {
+  while (WORD_CHAR.test(text)) {
     end++;
   }

[Killed] UpdateOperator
src/utils/exerciseContent.ts:57:5
     start--;
   }
   while (WORD_CHAR.test(text.charAt(end))) {
-    end++;
+    end--;
   }
 
killedBy: extractWordAtOffset - idempotence and containment is idempotent: re-expanding from inside the word yields the same word
statusReason: Property failed after 2 tests
{ seed: -70694634, path: "1:1:0:2:2:3", endOnFailure: true }
Counterexample: [["0",1]]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/utils/exerciseContent.ts:60:10
     end++;
   }
 
-  return text.substring(start, end);
+  return text;
 };
 
killedBy: extractWordAtOffset expands from inside a word to its full span
statusReason: expected 'czytam książkę' to be 'książkę' // Object.is equality

[Killed] BlockStatement
src/utils/exerciseContent.ts:64:58
 };
 
 /** Normalises a selected token, or null when it is not a plain word. */
-export const cleanWord = (raw: string): string | null => {
-  const cleaned = raw.replace(/[^\p{L}\p{N}]/gu, '');
-  return cleaned && /^[\p{L}]+$/u.test(cleaned) ? cleaned.toLowerCase() : null;
-};
+export const cleanWord = (raw: string): string | null => {};
 
 /**
killedBy: cleanWord lowercases and strips punctuation
statusReason: expected undefined to be 'książkę' // Object.is equality

[Killed] StringLiteral
src/utils/exerciseContent.ts:65:50
 
 /** Normalises a selected token, or null when it is not a plain word. */
 export const cleanWord = (raw: string): string | null => {
-  const cleaned = raw.replace(/[^\p{L}\p{N}]/gu, '');
+  const cleaned = raw.replace(/[^\p{L}\p{N}]/gu, "Stryker was here!");
   return cleaned && /^[\p{L}]+$/u.test(cleaned) ? cleaned.toLowerCase() : null;
 };
killedBy: cleanWord lowercases and strips punctuation
statusReason: expected null to be 'książkę' // Object.is equality

[Killed] Regex
src/utils/exerciseContent.ts:65:31
 
 /** Normalises a selected token, or null when it is not a plain word. */
 export const cleanWord = (raw: string): string | null => {
-  const cleaned = raw.replace(/[^\p{L}\p{N}]/gu, '');
+  const cleaned = raw.replace(/[^\P{L}\p{N}]/gu, '');
   return cleaned && /^[\p{L}]+$/u.test(cleaned) ? cleaned.toLowerCase() : null;
 };
killedBy: cleanWord lowercases and strips punctuation
statusReason: expected null to be 'książkę' // Object.is equality

[Killed] ConditionalExpression
src/utils/exerciseContent.ts:66:10
 /** Normalises a selected token, or null when it is not a plain word. */
 export const cleanWord = (raw: string): string | null => {
   const cleaned = raw.replace(/[^\p{L}\p{N}]/gu, '');
-  return cleaned && /^[\p{L}]+$/u.test(cleaned) ? cleaned.toLowerCase() : null;
+  return true ? cleaned.toLowerCase() : null;
 };
 
killedBy: cleanWord rejects tokens that contain digits
statusReason: expected 'rok2026' to be null

[Killed] MethodExpression
src/utils/exerciseContent.ts:66:51
 /** Normalises a selected token, or null when it is not a plain word. */
 export const cleanWord = (raw: string): string | null => {
   const cleaned = raw.replace(/[^\p{L}\p{N}]/gu, '');
-  return cleaned && /^[\p{L}]+$/u.test(cleaned) ? cleaned.toLowerCase() : null;
+  return cleaned && /^[\p{L}]+$/u.test(cleaned) ? cleaned.toUpperCase() : null;
 };
 
killedBy: cleanWord lowercases and strips punctuation
statusReason: expected 'KSIĄŻKĘ' to be 'książkę' // Object.is equality

[Killed] BlockStatement
src/utils/exerciseContent.ts:74:77
  * Prefers an explicitly labelled line ("Перевод: ..."), otherwise takes the
  * first remaining line. Returns null when there is nothing left to take.
  */
-export const takeTranslationLine = (extraLines: string[]): string | null => {
-  const labelled = extraLines.findIndex(line => TRANSLATION_LINE.test(line));
-  const index = labelled === -1 ? 0 : labelled;
-  const line = extraLines[index];
-
-  if (line === undefined) return null;
-
-  extraLines.splice(index, 1);
-  return stripTranslationLabel(line);
-};
+export const takeTranslationLine = (extraLines: string[]): string | null => {};
 
 /** Splits trailing "(hint1, hint2)" off a sentence. */
killedBy: takeTranslationLine - size preservation removes exactly one line when it returns a value, none otherwise
statusReason: Property failed after 1 tests
{ seed: 1167576981, path: "0", endOnFailure: true }
Counterexample: [[]]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/utils/exerciseContent.ts:75:41
  * first remaining line. Returns null when there is nothing left to take.
  */
 export const takeTranslationLine = (extraLines: string[]): string | null => {
-  const labelled = extraLines.findIndex(line => TRANSLATION_LINE.test(line));
+  const labelled = extraLines.findIndex(() => undefined);
   const index = labelled === -1 ? 0 : labelled;
   const line = extraLines[index];
killedBy: takeTranslationLine prefers a labelled line and removes it
statusReason: expected 'Uwaga: czas przeszły' to be 'Она читает' // Object.is equality

[Killed] ConditionalExpression
src/utils/exerciseContent.ts:76:17
  */
 export const takeTranslationLine = (extraLines: string[]): string | null => {
   const labelled = extraLines.findIndex(line => TRANSLATION_LINE.test(line));
-  const index = labelled === -1 ? 0 : labelled;
+  const index = true ? 0 : labelled;
   const line = extraLines[index];
 
killedBy: takeTranslationLine prefers a labelled line and removes it
statusReason: expected 'Uwaga: czas przeszły' to be 'Она читает' // Object.is equality

[Killed] ConditionalExpression
src/utils/exerciseContent.ts:76:17
  */
 export const takeTranslationLine = (extraLines: string[]): string | null => {
   const labelled = extraLines.findIndex(line => TRANSLATION_LINE.test(line));
-  const index = labelled === -1 ? 0 : labelled;
+  const index = false ? 0 : labelled;
   const line = extraLines[index];
 
killedBy: takeTranslationLine - size preservation only ever returns null for an empty list
statusReason: Property failed after 1 tests
{ seed: -844793019, path: "0:1:0", endOnFailure: true }
Counterexample: [[""]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/exerciseContent.ts:79:7
   const index = labelled === -1 ? 0 : labelled;
   const line = extraLines[index];
 
-  if (line === undefined) return null;
+  if (false) return null;
 
   extraLines.splice(index, 1);
killedBy: takeTranslationLine returns null and leaves an empty list untouched
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ConditionalExpression
src/utils/exerciseContent.ts:79:7
   const index = labelled === -1 ? 0 : labelled;
   const line = extraLines[index];
 
-  if (line === undefined) return null;
+  if (true) return null;
 
   extraLines.splice(index, 1);
killedBy: takeTranslationLine prefers a labelled line and removes it
statusReason: expected null to be 'Она читает' // Object.is equality

[Killed] BlockStatement
src/utils/exerciseContent.ts:86:79
 };
 
 /** Splits trailing "(hint1, hint2)" off a sentence. */
-export const takeHints = (line: string): { line: string; hints: string[] } => {
-  const match = line.match(TRAILING_HINTS);
-  if (!match?.[1]) return { line, hints: [] };
-
-  const hints = match[1]
-    .split(/[,;]+/)
-    .map(part => part.trim().replace(BOLD_PATTERN, '$1'))
-    .filter(Boolean);
-
-  return { line: line.replace(TRAILING_HINTS, '').trim(), hints };
-};
+export const takeHints = (line: string): { line: string; hints: string[] } => {};
 
 /** Splits an inline "Sentence. - translation" pair. */
killedBy: takeHints splits trailing hints off the sentence
statusReason: expected undefined to deeply equal { Object (line, hints) }

[Killed] BooleanLiteral
src/utils/exerciseContent.ts:88:7
 /** Splits trailing "(hint1, hint2)" off a sentence. */
 export const takeHints = (line: string): { line: string; hints: string[] } => {
   const match = line.match(TRAILING_HINTS);
-  if (!match?.[1]) return { line, hints: [] };
+  if (match?.[1]) return { line, hints: [] };
 
   const hints = match[1]
killedBy: takeHints splits trailing hints off the sentence
statusReason: expected { …(2) } to deeply equal { Object (line, hints) }

[Killed] OptionalChaining
src/utils/exerciseContent.ts:88:8
 /** Splits trailing "(hint1, hint2)" off a sentence. */
 export const takeHints = (line: string): { line: string; hints: string[] } => {
   const match = line.match(TRAILING_HINTS);
-  if (!match?.[1]) return { line, hints: [] };
+  if (!match[1]) return { line, hints: [] };
 
   const hints = match[1]
killedBy: takeHints returns no hints when there are no parentheses
statusReason: Cannot read properties of null (reading '1')

[Killed] MethodExpression
src/utils/exerciseContent.ts:90:17
   const match = line.match(TRAILING_HINTS);
   if (!match?.[1]) return { line, hints: [] };
 
-  const hints = match[1]
-    .split(/[,;]+/)
-    .map(part => part.trim().replace(BOLD_PATTERN, '$1'))
-    .filter(Boolean);
+  const hints = match[1].split(/[,;]+/).map(part => part.trim().replace(BOLD_PATTERN, '$1'));
 
   return { line: line.replace(TRAILING_HINTS, '').trim(), hints };
killedBy: takeHints drops a hint that is only whitespace
statusReason: expected [ 'a', '', 'b' ] to deeply equal [ 'a', 'b' ]

[Survived] Regex
src/utils/exerciseContent.ts:91:12
   if (!match?.[1]) return { line, hints: [] };
 
   const hints = match[1]
-    .split(/[,;]+/)
+    .split(/[,;]/)
     .map(part => part.trim().replace(BOLD_PATTERN, '$1'))
     .filter(Boolean);

[Killed] ArrowFunction
src/utils/exerciseContent.ts:92:10
 
   const hints = match[1]
     .split(/[,;]+/)
-    .map(part => part.trim().replace(BOLD_PATTERN, '$1'))
+    .map(() => undefined)
     .filter(Boolean);
 
killedBy: takeHints splits trailing hints off the sentence
statusReason: expected { Object (line, hints) } to deeply equal { Object (line, hints) }

[Killed] MethodExpression
src/utils/exerciseContent.ts:92:18
 
   const hints = match[1]
     .split(/[,;]+/)
-    .map(part => part.trim().replace(BOLD_PATTERN, '$1'))
+    .map(part => part.replace(BOLD_PATTERN, '$1'))
     .filter(Boolean);
 
killedBy: takeHints splits trailing hints off the sentence
statusReason: expected { Object (line, hints) } to deeply equal { Object (line, hints) }

[Killed] MethodExpression
src/utils/exerciseContent.ts:95:18
     .map(part => part.trim().replace(BOLD_PATTERN, '$1'))
     .filter(Boolean);
 
-  return { line: line.replace(TRAILING_HINTS, '').trim(), hints };
+  return { line: line.replace(TRAILING_HINTS, ''), hints };
 };
 
killedBy: takeHints trims the sentence it returns
statusReason: expected '   Zdanie.' to be 'Zdanie.' // Object.is equality

[Killed] StringLiteral
src/utils/exerciseContent.ts:95:47
     .map(part => part.trim().replace(BOLD_PATTERN, '$1'))
     .filter(Boolean);
 
-  return { line: line.replace(TRAILING_HINTS, '').trim(), hints };
+  return { line: line.replace(TRAILING_HINTS, "Stryker was here!").trim(), hints };
 };
 
killedBy: takeHints splits trailing hints off the sentence
statusReason: expected { …(2) } to deeply equal { Object (line, hints) }

[Killed] BlockStatement
src/utils/exerciseContent.ts:101:52
 /** Splits an inline "Sentence. - translation" pair. */
 export const takeInlineTranslation = (
   line: string
-): { line: string; translation: string | null } => {
-  const match = line.match(INLINE_DASH_TRANSLATION);
-  if (!match) return { line, translation: null };
-
-  const [, sentence = '', translation = ''] = match;
-  return { line: sentence.trim(), translation: stripTranslationLabel(translation) };
-};
+): { line: string; translation: string | null } => {};
 
 // `split` on '\n' plus a per-line trim already handles CRLF and indentation,
killedBy: takeInlineTranslation splits a sentence from its dash-separated translation
statusReason: expected undefined to deeply equal { line: 'Ona czyta.', …(1) }

[Killed] ConditionalExpression
src/utils/exerciseContent.ts:103:7
   line: string
 ): { line: string; translation: string | null } => {
   const match = line.match(INLINE_DASH_TRANSLATION);
-  if (!match) return { line, translation: null };
+  if (false) return { line, translation: null };
 
   const [, sentence = '', translation = ''] = match;
killedBy: takeInlineTranslation requires sentence-ending punctuation before the dash
statusReason: match is not iterable

[Killed] BooleanLiteral
src/utils/exerciseContent.ts:103:7
   line: string
 ): { line: string; translation: string | null } => {
   const match = line.match(INLINE_DASH_TRANSLATION);
-  if (!match) return { line, translation: null };
+  if (match) return { line, translation: null };
 
   const [, sentence = '', translation = ''] = match;
killedBy: takeInlineTranslation splits a sentence from its dash-separated translation
statusReason: expected { …(2) } to deeply equal { line: 'Ona czyta.', …(1) }

[Killed] MethodExpression
src/utils/exerciseContent.ts:106:18
   if (!match) return { line, translation: null };
 
   const [, sentence = '', translation = ''] = match;
-  return { line: sentence.trim(), translation: stripTranslationLabel(translation) };
+  return { line: sentence, translation: stripTranslationLabel(translation) };
 };
 
killedBy: takeInlineTranslation splits a sentence from its dash-separated translation
statusReason: expected { line: 'Ona czyta. ', …(1) } to deeply equal { line: 'Ona czyta.', …(1) }

[Killed] ArrowFunction
src/utils/exerciseContent.ts:111:20
 
 // `split` on '\n' plus a per-line trim already handles CRLF and indentation,
 // so no separate newline normalisation or outer trim is needed here.
-const splitLines = (rawText: string): string[] =>
-  rawText
-    .trim()
-    .replace(LEADING_NUMBERING, '')
-    .split('\n')
-    .map(line => line.trim())
-    .filter(Boolean);
+const splitLines = () => undefined;
 
 export const parseExerciseContent = (rawText: string): ParsedExerciseContent => {
killedBy: parseExerciseContent returns empty content for a blank string
statusReason: Cannot read properties of undefined (reading '0')

[Survived] MethodExpression
src/utils/exerciseContent.ts:112:3
 // `split` on '\n' plus a per-line trim already handles CRLF and indentation,
 // so no separate newline normalisation or outer trim is needed here.
 const splitLines = (rawText: string): string[] =>
-  rawText
-    .trim()
+  rawText
     .replace(LEADING_NUMBERING, '')
     .split('\n')

[Survived] MethodExpression
src/utils/exerciseContent.ts:112:3
 // `split` on '\n' plus a per-line trim already handles CRLF and indentation,
 // so no separate newline normalisation or outer trim is needed here.
 const splitLines = (rawText: string): string[] =>
-  rawText
-    .trim()
-    .replace(LEADING_NUMBERING, '')
-    .split('\n')
-    .map(line => line.trim())
-    .filter(Boolean);
+  rawText.trim().replace(LEADING_NUMBERING, '').split('\n').map(line => line.trim());
 
 export const parseExerciseContent = (rawText: string): ParsedExerciseContent => {

[Killed] ArrowFunction
src/utils/exerciseContent.ts:116:10
     .trim()
     .replace(LEADING_NUMBERING, '')
     .split('\n')
-    .map(line => line.trim())
+    .map(() => undefined)
     .filter(Boolean);
 
killedBy: parseExerciseContent replaces the bold marker with a blank
statusReason: expected '' to be 'Ona _____ książkę.' // Object.is equality

[Survived] MethodExpression
src/utils/exerciseContent.ts:116:18
     .trim()
     .replace(LEADING_NUMBERING, '')
     .split('\n')
-    .map(line => line.trim())
+    .map(line => line)
     .filter(Boolean);
 

[Killed] ConditionalExpression
src/utils/exerciseContent.ts:122:7
 export const parseExerciseContent = (rawText: string): ParsedExerciseContent => {
   const lines = splitLines(rawText);
   const firstLine = lines[0];
-  if (firstLine === undefined) return EMPTY_PARSED_CONTENT;
+  if (false) return EMPTY_PARSED_CONTENT;
 
   const additionalNotes = lines.slice(1);
killedBy: parseExerciseContent returns empty content for a blank string
statusReason: Cannot read properties of undefined (reading 'match')

[Killed] EqualityOperator
src/utils/exerciseContent.ts:122:7
 export const parseExerciseContent = (rawText: string): ParsedExerciseContent => {
   const lines = splitLines(rawText);
   const firstLine = lines[0];
-  if (firstLine === undefined) return EMPTY_PARSED_CONTENT;
+  if (firstLine !== undefined) return EMPTY_PARSED_CONTENT;
 
   const additionalNotes = lines.slice(1);
killedBy: parseExerciseContent returns empty content for a blank string
statusReason: Cannot read properties of undefined (reading 'match')

[Killed] MethodExpression
src/utils/exerciseContent.ts:124:27
   const firstLine = lines[0];
   if (firstLine === undefined) return EMPTY_PARSED_CONTENT;
 
-  const additionalNotes = lines.slice(1);
+  const additionalNotes = lines;
   const withoutHints = takeHints(firstLine);
   const withoutInline = takeInlineTranslation(withoutHints.line);
killedBy: parseExerciseContent takes the translation from a following line when there is no bold marker
statusReason: expected 'Ona {{input}} książkę.' to be 'Она читает книгу' // Object.is equality

[Killed] LogicalOperator
src/utils/exerciseContent.ts:132:5
   const hasBoldFormat = BOLD_PATTERN.test(withoutInline.line);
 
   const translation =
-    withoutInline.translation ?? (hasBoldFormat ? null : takeTranslationLine(additionalNotes));
+    withoutInline.translation && (hasBoldFormat ? null : takeTranslationLine(additionalNotes));
 
   const displaySentence = hasBoldFormat
killedBy: parseExerciseContent takes the translation from a following line when there is no bold marker
statusReason: expected null to be 'Она читает книгу' // Object.is equality

[Killed] ObjectLiteral
src/utils/exerciseContent.ts:138:10
     ? withoutInline.line.replace(BOLD_PATTERN, '_____')
     : withoutInline.line.replace(PLACEHOLDER_REGEX, '_____');
 
-  return {
-    displaySentence,
-    prefillSentence: displaySentence,
-    hints: withoutHints.hints,
-    translation: translation || null,
-    additionalNotes
-  };
+  return {};
 };
 
killedBy: parseExerciseContent replaces the bold marker with a blank
statusReason: expected undefined to be 'Ona _____ książkę.' // Object.is equality

[Killed] ConditionalExpression
src/utils/exerciseContent.ts:142:18
     displaySentence,
     prefillSentence: displaySentence,
     hints: withoutHints.hints,
-    translation: translation || null,
+    translation: true,
     additionalNotes
   };
killedBy: parseExerciseContent takes the translation from a following line when there is no bold marker
statusReason: expected true to be 'Она читает книгу' // Object.is equality

[Killed] ConditionalExpression
src/utils/exerciseContent.ts:142:18
     displaySentence,
     prefillSentence: displaySentence,
     hints: withoutHints.hints,
-    translation: translation || null,
+    translation: false,
     additionalNotes
   };
killedBy: parseExerciseContent takes the translation from a following line when there is no bold marker
statusReason: expected false to be 'Она читает книгу' // Object.is equality
