[Killed] BlockStatement
src/utils/languageRedirect.ts:8:18
 export function resolveLanguageSwitchRedirect(
   pathname: string | null,
   newTopic: string | null
-): string | null {
-  if (!pathname?.startsWith('/exercises/')) return null;
-
-  const currentPath = pathname.split('/').pop();
-  // The history page is language-agnostic, never redirect away from it.
-  if (currentPath === 'generated-history') return null;
-
-  // No saved topic for the new language - fall back to the topic list.
-  if (!newTopic) return '/topics';
-
-  const newPath = newTopic.toLowerCase().replace(/ /g, '_');
-  return currentPath === newPath ? null : `/exercises/${newPath}`;
-}
+): string | null {}
 
killedBy: resolveLanguageSwitchRedirect stays put when not on an exercises page
statusReason: expected undefined to be null

[Killed] MethodExpression
src/utils/languageRedirect.ts:9:8
   pathname: string | null,
   newTopic: string | null
 ): string | null {
-  if (!pathname?.startsWith('/exercises/')) return null;
+  if (!pathname?.endsWith('/exercises/')) return null;
 
   const currentPath = pathname.split('/').pop();
killedBy: resolveLanguageSwitchRedirect falls back to the topic list when the new language has no saved topic
statusReason: expected null to be '/topics' // Object.is equality

[Killed] ConditionalExpression
src/utils/languageRedirect.ts:9:7
   pathname: string | null,
   newTopic: string | null
 ): string | null {
-  if (!pathname?.startsWith('/exercises/')) return null;
+  if (true) return null;
 
   const currentPath = pathname.split('/').pop();
killedBy: resolveLanguageSwitchRedirect falls back to the topic list when the new language has no saved topic
statusReason: expected null to be '/topics' // Object.is equality

[Killed] ConditionalExpression
src/utils/languageRedirect.ts:13:7
 
   const currentPath = pathname.split('/').pop();
   // The history page is language-agnostic, never redirect away from it.
-  if (currentPath === 'generated-history') return null;
+  if (true) return null;
 
   // No saved topic for the new language - fall back to the topic list.
killedBy: resolveLanguageSwitchRedirect falls back to the topic list when the new language has no saved topic
statusReason: expected null to be '/topics' // Object.is equality

[Killed] ConditionalExpression
src/utils/languageRedirect.ts:13:7
 
   const currentPath = pathname.split('/').pop();
   // The history page is language-agnostic, never redirect away from it.
-  if (currentPath === 'generated-history') return null;
+  if (false) return null;
 
   // No saved topic for the new language - fall back to the topic list.
killedBy: resolveLanguageSwitchRedirect never redirects away from the history page
statusReason: expected '/exercises/past_simple' to be null

[Killed] ConditionalExpression
src/utils/languageRedirect.ts:16:7
   if (currentPath === 'generated-history') return null;
 
   // No saved topic for the new language - fall back to the topic list.
-  if (!newTopic) return '/topics';
+  if (true) return '/topics';
 
   const newPath = newTopic.toLowerCase().replace(/ /g, '_');
killedBy: resolveLanguageSwitchRedirect redirects to the topic saved for the new language
statusReason: expected '/topics' to be '/exercises/present_perfect' // Object.is equality

[Killed] ConditionalExpression
src/utils/languageRedirect.ts:16:7
   if (currentPath === 'generated-history') return null;
 
   // No saved topic for the new language - fall back to the topic list.
-  if (!newTopic) return '/topics';
+  if (false) return '/topics';
 
   const newPath = newTopic.toLowerCase().replace(/ /g, '_');
killedBy: resolveLanguageSwitchRedirect falls back to the topic list when the new language has no saved topic
statusReason: Cannot read properties of null (reading 'toLowerCase')

[Killed] MethodExpression
src/utils/languageRedirect.ts:18:19
   // No saved topic for the new language - fall back to the topic list.
   if (!newTopic) return '/topics';
 
-  const newPath = newTopic.toLowerCase().replace(/ /g, '_');
+  const newPath = newTopic.toUpperCase().replace(/ /g, '_');
   return currentPath === newPath ? null : `/exercises/${newPath}`;
 }
killedBy: resolveLanguageSwitchRedirect redirects to the topic saved for the new language
statusReason: expected '/exercises/PRESENT_PERFECT' to be '/exercises/present_perfect' // Object.is equality

[Killed] EqualityOperator
src/utils/languageRedirect.ts:19:10
   if (!newTopic) return '/topics';
 
   const newPath = newTopic.toLowerCase().replace(/ /g, '_');
-  return currentPath === newPath ? null : `/exercises/${newPath}`;
+  return currentPath !== newPath ? null : `/exercises/${newPath}`;
 }
 
killedBy: resolveLanguageSwitchRedirect redirects to the topic saved for the new language
statusReason: expected null to be '/exercises/present_perfect' // Object.is equality

[Killed] ConditionalExpression
src/utils/languageRedirect.ts:19:10
   if (!newTopic) return '/topics';
 
   const newPath = newTopic.toLowerCase().replace(/ /g, '_');
-  return currentPath === newPath ? null : `/exercises/${newPath}`;
+  return false ? null : `/exercises/${newPath}`;
 }
 
killedBy: resolveLanguageSwitchRedirect stays put when the saved topic is the current one
statusReason: expected '/exercises/past_simple' to be null
