[Killed] BlockStatement
src/utils/crypto.ts:10:54
  * Validated lazily so a missing TOKEN_SECRET fails at call time with a clear
  * message instead of silently encrypting with `undefined`.
  */
-function resolveKey(key: string | undefined): string {
-  const resolved = key ?? process.env.TOKEN_SECRET;
-  if (!resolved) {
-    throw new Error('TOKEN_SECRET environment variable is required');
-  }
-  return resolved;
-}
+function resolveKey(key: string | undefined): string {}
 
 function encrypt(plaintext: string, key?: string): string {
killedBy: encrypt / decrypt - reversibility decrypt undoes encrypt for any string
statusReason: Property failed after 1 tests
{ seed: 584766668, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/utils/crypto.ts:11:20
  * message instead of silently encrypting with `undefined`.
  */
 function resolveKey(key: string | undefined): string {
-  const resolved = key ?? process.env.TOKEN_SECRET;
+  const resolved = key && process.env.TOKEN_SECRET;
   if (!resolved) {
     throw new Error('TOKEN_SECRET environment variable is required');
killedBy: encrypt / decrypt - reversibility decrypt undoes encrypt for any string
statusReason: Property failed after 1 tests
{ seed: -521957477, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/crypto.ts:12:7
  */
 function resolveKey(key: string | undefined): string {
   const resolved = key ?? process.env.TOKEN_SECRET;
-  if (!resolved) {
+  if (false) {
     throw new Error('TOKEN_SECRET environment variable is required');
   }
killedBy: encrypt / decrypt requires a key when TOKEN_SECRET is unset
statusReason: expected [Function] to throw error matching /TOKEN_SECRET/ but got 'The "key" argument must be of type st…'

[Killed] ConditionalExpression
src/utils/crypto.ts:12:7
  */
 function resolveKey(key: string | undefined): string {
   const resolved = key ?? process.env.TOKEN_SECRET;
-  if (!resolved) {
+  if (true) {
     throw new Error('TOKEN_SECRET environment variable is required');
   }
killedBy: encrypt / decrypt - reversibility decrypt undoes encrypt for any string
statusReason: Property failed after 1 tests
{ seed: -1562340056, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/crypto.ts:18:59
   return resolved;
 }
 
-function encrypt(plaintext: string, key?: string): string {
-  const iv = crypto.randomBytes(16);
-  const cipher = crypto.createCipheriv(ALGORITHM, resolveKey(key), iv);
-  let encrypted = cipher.update(plaintext, 'utf8', 'base64');
-  encrypted += cipher.final('base64');
-
-  return iv.toString('base64') + ':' + encrypted;
-}
+function encrypt(plaintext: string, key?: string): string {}
 
 function decrypt(cipherText: string, key?: string): string {
killedBy: encrypt / decrypt - reversibility decrypt undoes encrypt for any string
statusReason: Property failed after 1 tests
{ seed: 1821224105, path: "0", endOnFailure: true }
Counterexample: [""]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] AssignmentOperator
src/utils/crypto.ts:22:3
   const iv = crypto.randomBytes(16);
   const cipher = crypto.createCipheriv(ALGORITHM, resolveKey(key), iv);
   let encrypted = cipher.update(plaintext, 'utf8', 'base64');
-  encrypted += cipher.final('base64');
+  encrypted -= cipher.final('base64');
 
   return iv.toString('base64') + ':' + encrypted;
killedBy: encrypt / decrypt - reversibility decrypt undoes encrypt for any string
statusReason: Property failed after 1 tests
{ seed: -1393228620, path: "0", endOnFailure: true }
Counterexample: [""]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/utils/crypto.ts:24:22
   let encrypted = cipher.update(plaintext, 'utf8', 'base64');
   encrypted += cipher.final('base64');
 
-  return iv.toString('base64') + ':' + encrypted;
+  return iv.toString("") + ':' + encrypted;
 }
 
killedBy: encrypt / decrypt - reversibility decrypt undoes encrypt for any string
statusReason: Property failed after 1 tests
{ seed: 228511310, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/crypto.ts:27:60
   return iv.toString('base64') + ':' + encrypted;
 }
 
-function decrypt(cipherText: string, key?: string): string {
-  const [ivBase64, encrypted] = cipherText.split(':');
-  if (ivBase64 === undefined || encrypted === undefined) {
-    throw new Error('Malformed cipher text: expected "<iv>:<payload>"');
-  }
-
-  const iv = Buffer.from(ivBase64, 'base64');
-  const decipher = crypto.createDecipheriv(ALGORITHM, resolveKey(key), iv);
-  let decrypted = decipher.update(encrypted, 'base64', 'utf8');
-  decrypted += decipher.final('utf8');
-
-  return decrypted;
-}
+function decrypt(cipherText: string, key?: string): string {}
 
 export { encrypt, decrypt };
killedBy: encrypt / decrypt - reversibility decrypt undoes encrypt for any string
statusReason: Property failed after 1 tests
{ seed: -2086111420, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/utils/crypto.ts:29:7
 
 function decrypt(cipherText: string, key?: string): string {
   const [ivBase64, encrypted] = cipherText.split(':');
-  if (ivBase64 === undefined || encrypted === undefined) {
+  if (ivBase64 === undefined && encrypted === undefined) {
     throw new Error('Malformed cipher text: expected "<iv>:<payload>"');
   }
killedBy: encrypt / decrypt rejects cipher text without a separator
statusReason: expected [Function] to throw error matching /Malformed cipher text/ but got 'Invalid initialization vector'

[Killed] ConditionalExpression
src/utils/crypto.ts:29:7
 
 function decrypt(cipherText: string, key?: string): string {
   const [ivBase64, encrypted] = cipherText.split(':');
-  if (ivBase64 === undefined || encrypted === undefined) {
+  if (false) {
     throw new Error('Malformed cipher text: expected "<iv>:<payload>"');
   }
killedBy: encrypt / decrypt rejects cipher text without a separator
statusReason: expected [Function] to throw error matching /Malformed cipher text/ but got 'Invalid initialization vector'

[Killed] StringLiteral
src/utils/crypto.ts:30:21
 function decrypt(cipherText: string, key?: string): string {
   const [ivBase64, encrypted] = cipherText.split(':');
   if (ivBase64 === undefined || encrypted === undefined) {
-    throw new Error('Malformed cipher text: expected "<iv>:<payload>"');
+    throw new Error("");
   }
 
killedBy: encrypt / decrypt rejects cipher text without a separator
statusReason: expected [Function] to throw error matching /Malformed cipher text/ but got ''

[Killed] StringLiteral
src/utils/crypto.ts:35:46
 
   const iv = Buffer.from(ivBase64, 'base64');
   const decipher = crypto.createDecipheriv(ALGORITHM, resolveKey(key), iv);
-  let decrypted = decipher.update(encrypted, 'base64', 'utf8');
+  let decrypted = decipher.update(encrypted, "", 'utf8');
   decrypted += decipher.final('utf8');
 
killedBy: encrypt / decrypt round-trips a plain string
statusReason: error:1C80006B:Provider routines::wrong final block length

[Killed] AssignmentOperator
src/utils/crypto.ts:36:3
   const iv = Buffer.from(ivBase64, 'base64');
   const decipher = crypto.createDecipheriv(ALGORITHM, resolveKey(key), iv);
   let decrypted = decipher.update(encrypted, 'base64', 'utf8');
-  decrypted += decipher.final('utf8');
+  decrypted -= decipher.final('utf8');
 
   return decrypted;
killedBy: encrypt / decrypt round-trips a plain string
statusReason: expected NaN to be 'hello' // Object.is equality

[Killed] StringLiteral
src/utils/crypto.ts:36:31
   const iv = Buffer.from(ivBase64, 'base64');
   const decipher = crypto.createDecipheriv(ALGORITHM, resolveKey(key), iv);
   let decrypted = decipher.update(encrypted, 'base64', 'utf8');
-  decrypted += decipher.final('utf8');
+  decrypted += decipher.final("");
 
   return decrypted;
killedBy: encrypt / decrypt - reversibility holds for arbitrary unicode, including astral planes
statusReason: Property failed after 1 tests
{ seed: 259487834, path: "0:2:2:2:2:2:2:2:2:2:4:3:3:7:7:7:6:7:8:6:6:11:9:9:9:9:11:9:10:9:10:13:17:12:15:17:20:17:16:16:19:16", endOnFailure: true }
Counterexample: [" ࠀ𐀀𐀀𐀀"]
Shrunk 41 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
