[Killed] BlockStatement
src/utils/omitUndefined.ts:10:81
  */
 export type WithoutUndefined<T> = { [K in keyof T]?: Exclude<T[K], undefined> };
 
-export function omitUndefined<T extends object>(source: T): WithoutUndefined<T> {
-  const result: WithoutUndefined<T> = {};
-
-  for (const key of Object.keys(source) as (keyof T)[]) {
-    const value = source[key];
-    if (value !== undefined) {
-      // defineProperty, not assignment: `result['__proto__'] = v` mutates the
-      // prototype instead of creating an own property, silently losing the key.
-      Object.defineProperty(result, key, {
-        value,
-        enumerable: true,
-        writable: true,
-        configurable: true
-      });
-    }
-  }
-
-  return result;
-}
+export function omitUndefined<T extends object>(source: T): WithoutUndefined<T> {}
 
killedBy: omitUndefined - idempotence and key preservation keeps exactly the keys whose value is defined
statusReason: Property failed after 1 tests
{ seed: 1294688124, path: "0:0", endOnFailure: true }
Counterexample: [{}]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/omitUndefined.ts:13:57
 export function omitUndefined<T extends object>(source: T): WithoutUndefined<T> {
   const result: WithoutUndefined<T> = {};
 
-  for (const key of Object.keys(source) as (keyof T)[]) {
-    const value = source[key];
-    if (value !== undefined) {
-      // defineProperty, not assignment: `result['__proto__'] = v` mutates the
-      // prototype instead of creating an own property, silently losing the key.
-      Object.defineProperty(result, key, {
-        value,
-        enumerable: true,
-        writable: true,
-        configurable: true
-      });
-    }
-  }
+  for (const key of Object.keys(source) as (keyof T)[]) {}
 
   return result;
killedBy: omitUndefined - idempotence and key preservation keeps exactly the keys whose value is defined
statusReason: Property failed after 1 tests
{ seed: -888421611, path: "0:1:0:0:1:1", endOnFailure: true }
Counterexample: [{"":null}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/utils/omitUndefined.ts:15:9
 
   for (const key of Object.keys(source) as (keyof T)[]) {
     const value = source[key];
-    if (value !== undefined) {
+    if (value === undefined) {
       // defineProperty, not assignment: `result['__proto__'] = v` mutates the
       // prototype instead of creating an own property, silently losing the key.
killedBy: omitUndefined - idempotence and key preservation keeps exactly the keys whose value is defined
statusReason: Property failed after 1 tests
{ seed: 909638261, path: "0:1:0:0:0:1", endOnFailure: true }
Counterexample: [{"":undefined}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/omitUndefined.ts:15:9
 
   for (const key of Object.keys(source) as (keyof T)[]) {
     const value = source[key];
-    if (value !== undefined) {
+    if (true) {
       // defineProperty, not assignment: `result['__proto__'] = v` mutates the
       // prototype instead of creating an own property, silently losing the key.
killedBy: omitUndefined - idempotence and key preservation keeps exactly the keys whose value is defined
statusReason: Property failed after 1 tests
{ seed: 390018011, path: "0:1:1:1:2:1", endOnFailure: true }
Counterexample: [{"":undefined}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
src/utils/omitUndefined.ts:18:42
     if (value !== undefined) {
       // defineProperty, not assignment: `result['__proto__'] = v` mutates the
       // prototype instead of creating an own property, silently losing the key.
-      Object.defineProperty(result, key, {
-        value,
-        enumerable: true,
-        writable: true,
-        configurable: true
-      });
+      Object.defineProperty(result, key, {});
     }
   }
killedBy: omitUndefined - idempotence and key preservation keeps exactly the keys whose value is defined
statusReason: Property failed after 1 tests
{ seed: 1995968123, path: "0:1:1", endOnFailure: true }
Counterexample: [{"":false}]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/utils/omitUndefined.ts:20:21
       // prototype instead of creating an own property, silently losing the key.
       Object.defineProperty(result, key, {
         value,
-        enumerable: true,
+        enumerable: false,
         writable: true,
         configurable: true
killedBy: omitUndefined - idempotence and key preservation keeps exactly the keys whose value is defined
statusReason: Property failed after 2 tests
{ seed: 818372978, path: "1:1:0:1:1", endOnFailure: true }
Counterexample: [{"":false}]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] BooleanLiteral
src/utils/omitUndefined.ts:21:19
       Object.defineProperty(result, key, {
         value,
         enumerable: true,
-        writable: true,
+        writable: false,
         configurable: true
       });

[Survived] BooleanLiteral
src/utils/omitUndefined.ts:22:23
         value,
         enumerable: true,
         writable: true,
-        configurable: true
+        configurable: false
       });
     }
